In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import warnings
warnings.filterwarnings(action='ignore')

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  adult & sex  891 non-null    object
dtypes: bool(2), category(2), float64(2), int64(4), object(6)
memory usage: 87.6+ KB

a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. 
category1 카테고리는 다음과 같이 정의됨
1) 20살이 넘으면 성별을 그대로 사용한다.
2) 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [13]:
# 조건에 맞는 데이터들의 인덱스를 이용 
# who컬럼의 값을 변경하고자 한다.

f = titanic.age[titanic.age < 20].index
f = np.array(f,int)
f

array([  7,   9,  10,  14,  16,  22,  24,  27,  38,  39,  43,  44,  49,
        50,  58,  59,  63,  67,  68,  71,  78,  84,  86, 111, 114, 119,
       125, 136, 138, 143, 144, 145, 147, 156, 163, 164, 165, 171, 172,
       175, 182, 183, 184, 191, 192, 193, 204, 205, 208, 220, 226, 228,
       233, 237, 238, 261, 266, 278, 282, 283, 291, 297, 302, 305, 307,
       311, 329, 333, 340, 348, 352, 371, 372, 374, 379, 381, 385, 386,
       389, 407, 417, 419, 424, 427, 433, 435, 445, 446, 448, 469, 479,
       480, 489, 500, 504, 505, 530, 532, 535, 541, 542, 546, 549, 550,
       566, 574, 575, 585, 618, 634, 642, 644, 646, 651, 654, 675, 677,
       683, 686, 687, 688, 689, 691, 700, 702, 715, 720, 721, 731, 746,
       748, 750, 751, 755, 757, 764, 775, 777, 780, 781, 786, 787, 788,
       791, 802, 803, 807, 813, 819, 824, 827, 830, 831, 834, 841, 844,
       850, 852, 853, 855, 869, 875, 877, 887])

In [18]:
titanic.who[f].values

array(['child', 'child', 'child', 'child', 'child', 'child', 'child',
       'man', 'woman', 'child', 'child', 'woman', 'woman', 'child',
       'child', 'child', 'child', 'man', 'woman', 'woman', 'child',
       'woman', 'man', 'child', 'woman', 'child', 'child', 'woman', 'man',
       'man', 'man', 'man', 'child', 'woman', 'man', 'child', 'child',
       'child', 'child', 'man', 'child', 'child', 'child', 'man', 'woman',
       'child', 'man', 'child', 'woman', 'man', 'man', 'man', 'child',
       'child', 'man', 'child', 'man', 'child', 'man', 'man', 'woman',
       'child', 'man', 'child', 'woman', 'woman', 'woman', 'man', 'child',
       'child', 'child', 'man', 'man', 'child', 'man', 'child', 'man',
       'child', 'woman', 'child', 'woman', 'child', 'man', 'woman', 'man',
       'child', 'child', 'child', 'child', 'child', 'child', 'child',
       'child', 'man', 'woman', 'man', 'child', 'man', 'child', 'child',
       'child', 'woman', 'child', 'man', 'man', 'man', 'man', 'woman',
       'child', 'child', 'child', 'child', 'man', 'woman', 'woman', 'man',
       'woman', 'child', 'child', 'man', 'man', 'child', 'child', 'woman',
       'woman', 'man', 'child', 'man', 'child', 'man', 'man', 'child',
       'child', 'child', 'man', 'man', 'man', 'child', 'child', 'woman',
       'woman', 'child', 'child', 'man', 'child', 'child', 'woman',
       'child', 'child', 'child', 'child', 'child', 'child', 'man', 'man',
       'man', 'child', 'child', 'woman', 'woman', 'child', 'child', 'man',
       'woman'], dtype=object)

In [47]:
# 1. "adult % sex" 컬럼 생성하여 sex 컬럼 그대로 입력.
titanic["adult & sex"] = titanic["sex"]
# titanic["adult & sex"]

In [48]:
# 1. "adult % sex" 컬럼 생성하여 20세 미만 "child" 로 채우기
titanic["adult & sex"] = titanic.apply(lambda r: "child" if r.age < 20 else titanic["adult & sex"], axis=1)
titanic["adult & sex"].value_counts()

male     727
child    164
Name: adult & sex, dtype: int64